[
    [
        "COMPSCI 101",
        "15 Points",
        "An introduction to computers and computer programming in a high-level language. The role of computers and computer professionals in society is also introduced. The course is intended for students who may wish to advance in Computer Science or in Information Systems and Operations Management.",
        [
            "Restriction: Cannot be taken with or after COMPSCI 105, 107, 130, 210-220, 230-289, 313-399"
        ]
    ],
    [
        "COMPSCI 110",
        "15 Points",
        "An introduction to the various layers that make up a modern computer system: encoding of data and instructions, hardware, low-level programming, operating systems, applications and communications.",
        [
            "Restriction: Cannot be taken with or after COMPSCI 210"
        ]
    ],
    [
        "COMPSCI 111",
        "15 Points",
        "",
        []
    ],
    [
        "COMPSCI 111G",
        "15 Points",
        "A practical introduction to computing. Topics include: web design, an overview of computer hardware and operating systems, effective use of common applications, using the internet as a communication medium, applying programming concepts, and social implications of technology.",
        [
            "Restriction: Cannot be taken with or after COMPSCI 210, 220, 230"
        ]
    ],
    [
        "COMPSCI 120",
        "15 Points",
        "Basic mathematical tools and methods needed for computer science are introduced. Elementary mathematical skills for defining, analysing and reasoning with abstract objects used in programming are developed. Topics include integers and rational numbers, strings and sets, methods of proof (including induction), algorithms and functions, and elementary introductions to graphs, trees, counting and probability.",
        [
            "Prerequisite: MATHS 102 or at least 13 credits in Mathematics at NCEA Level 3 or D in CIE A2 Mathematics or C in CIE AS Mathematics or 3 out of 7 in IB Mathematics",
            "Restriction: Cannot be taken with, or after, COMPSCI 225, MATHS 254, 255"
        ]
    ],
    [
        "COMPSCI 130",
        "15 Points",
        "Fundamental programming techniques and processes, such as conditionals, iteration, recursion, functions, testing and debugging. Efficient ways to organise and manipulate data, including sorting and searching algorithms. Writing software that uses and implements common abstract data types such as lists, stacks, queues, dictionaries and trees. Prerequisite: COMPSCI 101, or Achievement Standard NCEA Level 3 Digital Technologies and Programming: 91906 Use complex programming techniques to develop a computer program, or 91637 Develop a complex computer program for a specified task",
        [
            "Restriction: COMPSCI 105, 107"
        ]
    ],
    [
        "COMPSCI 210",
        "15 Points",
        "The low level representation of data and algorithms in the computer. An introduction to computer organisation. The instruction execution model. Assembly and disassembly of instructions. Assembly language programming. How a high-level language is implemented at the machine level. The memory subsystem. Hardware support necessary to implement a secure multi-user operating system.",
        [
            "Prerequisite: COMPSCI 110, and 15 points from COMPSCI 105, 107, 130"
        ]
    ],
    [
        "COMPSCI 215",
        "15 Points",
        "An introduction to data communications: the OSI reference model, particularly how the lower layers combine to implement the application layer. An introduction to secure communication and computer systems.",
        [
            "Prerequisite: COMPSCI 110 and PHYSICS 140 and 15 points from COMPSCI 105, 107, 130"
        ]
    ],
    [
        "COMPSCI 220",
        "15 Points",
        "An introduction to the analysis of algorithms and data structures. Common abstract data types and their implementations. Asymptotic complexity analysis. Sorting and searching algorithms. Depth-first and breadth-first search and applications. Graph optimisation problems.",
        [
            "Prerequisite: COMPSCI 120 and 15 points from COMPSCI 105, 107, 130"
        ]
    ],
    [
        "COMPSCI 225",
        "15 Points",
        "An introduction to the foundations of computer science, mathematics and logic. Topics include logic, principles of counting, mathematical induction, recursion, sets and functions, graphs, codes, and finite automata.",
        [
            "Prerequisite: 15 points from COMPSCI 120, MATHS 120, 150, 153",
            "Restriction: MATHS 255"
        ]
    ],
    [
        "COMPSCI 230",
        "15 Points",
        "The design and implementation of object-oriented programmes. Analysis and design. Modelling with UML. Design for reuse, for testing, and for ease of change. Programming with classes, objects and polymorphism.",
        [
            "Prerequisite: 15 points from COMPSCI 105, 107, 130"
        ]
    ],
    [
        "COMPSCI 235",
        "15 Points",
        "An introduction to software development, including processes, best practices, tools and quality assurance techniques such as testing.",
        [
            "Prerequisite: 15 points from COMPSCI 105, 107, 130",
            "Restriction: COMPSCI 280"
        ]
    ],
    [
        "COMPSCI 289",
        "15 Points",
        "An introduction to research topics in computer science. Students will be expected to prepare and deliver a review of research in a topic of their choice. Research articles will be provided during the course, and will consist of key scientific publications.",
        [
            "Prerequisite: Minimum GPA of 5.0 and COMPSCI 110, 120, 130"
        ]
    ],
    [
        "COMPSCI 290",
        "15 Points",
        "",
        []
    ],
    [
        "COMPSCI 313",
        "15 Points",
        "Modern processor architectures. Principles of modern processor design; pipelining; memory hierarchies; I/O and network interfacing; compiler and OS support; embedded processors; performance; multiprocessing.",
        [
            "Prerequisite: COMPSCI 210, 215, PHYSICS 140",
            "Restriction: SOFTENG 363, COMPSYS 304"
        ]
    ],
    [
        "COMPSCI 315",
        "15 Points",
        "The structure of data communications and networks, including the internet, covering all levels of the communications architecture. The layered protocol model, data transmission and coding, link-level and local area network protocols, wide-area internet working, routing, transport and security protocols. Basic application protocols as the foundation for distributed computing.",
        [
            "Prerequisite: COMPSCI 210, 215",
            "Restriction: COMPSCI 314"
        ]
    ],
    [
        "COMPSCI 316",
        "15 Points",
        "Introduces various concepts related to software, system and network security. Covers a range of topics including attacks on privacy and attack surface, static and dynamic analysis of malware, hardware security (trusted computing base, secure boot, and attestation), network security and some hot topics in cryptography including elliptic curve, blockchain and bitcoin.",
        [
            "Prerequisite: COMPSCI 210, 215"
        ]
    ],
    [
        "COMPSCI 320",
        "15 Points",
        "Fundamental design techniques used for efficient algorithmic problem-solving and software development. Methods that yield algorithms that are both provably correct and efficient. Efficiency of algorithms to provide a basis for deciding which algorithm is best for the job. Limits on the power of computers and the theory of NP-completeness. An introduction to methods whose correctness or performance is not guaranteed.",
        [
            "Prerequisite: COMPSCI 220 and 15 points from COMPSCI 225, MATHS 254, 255"
        ]
    ],
    [
        "COMPSCI 331",
        "15 Points",
        "Students will understand how to develop large-scale software systems, and learn about the issues associated with large-scale software systems and techniques for addressing them.",
        [
            "Prerequisite: COMPSCI 230, 235"
        ]
    ],
    [
        "COMPSCI 335",
        "15 Points",
        "Covers functional programming concepts, with applications to data integration from heterogeneous and asynchronous collections. Building web and cloud clients and services, with emphasis on high-level declarative and functional techniques. Dynamic web applications. Security and performance as overarching factors of web application development.",
        [
            "Prerequisite: COMPSCI 230 and 15 points at Stage II in Computer Science"
        ]
    ],
    [
        "COMPSCI 340",
        "15 Points",
        "Operating system principles. Multi-user systems. Virtualisation. Scheduling. Concurrent processes, threads, synchronisation and deadlock. Memory allocation and virtual memory. Managing files, disks and other peripherals. Security, protection and archiving. Distributed systems and algorithms, location, migration and replication transparency. Real-time requirements. History of operating systems.",
        [
            "Prerequisite: COMPSCI 210, 230",
            "Restriction: SOFTENG 370"
        ]
    ],
    [
        "COMPSCI 345",
        "15 Points",
        "Human behaviour and humans' expectations of computers. Computer interfaces and the interaction between humans and computers. The significance of the user interface, interface design and user centred design process in software development. Interface usability evaluation methodologies and practice. Includes a group development and evaluation project using current implementation techniques and tools.",
        [
            "Prerequisite: COMPSCI 230 or SOFTENG 206",
            "Restriction: SOFTENG 350"
        ]
    ],
    [
        "COMPSCI 350",
        "15 Points",
        "The aim of this course is to present mathematical models for programming languages and computation, and derive some theorems regarding what can and cannot be computed. Abstract programming languages (finite automata, context-free grammars, Turing and register machines) are studied. Basic concepts for programming languages, limits on computational power and algorithmic complexity are presented. Church-Turing thesis and quantum computing are briefly and critically discussed.",
        [
            "Prerequisite: COMPSCI 220 or PHIL 222, and 15 points from COMPSCI 225, MATHS 254, 255"
        ]
    ],
    [
        "COMPSCI 351",
        "15 Points",
        "Database principles. Relational model, Relational Algebra, Relational Calculus, SQL, SQL and Programming Languages, Entity Relationship Model, Normalisation, Query Processing and Query Optimisation, ACID Transactions, Transaction Isolation Levels, Database Recovery, Database Security, Databases and XML.",
        [
            "Prerequisite: COMPSCI 220 and 15 points from COMPSCI 225, MATHS 254, 255",
            "Restriction: COMPSCI 751, SOFTENG 351"
        ]
    ],
    [
        "COMPSCI 361",
        "15 Points",
        "Machine learning is a branch of artificial intelligence concerned with making accurate, interpretable, computationally efficient, and robust inferences from data to solve a given problem. Understand the foundations of machine learning, and introduce practical skills to solve different problems.",
        [
            "Prerequisite: COMPSCI 220, and 15 points from DATASCI 100, STATS 101, 108, and 15 points from COMPSCI 225, MATHS 254, 255",
            "Restriction: COMPSCI 762"
        ]
    ],
    [
        "COMPSCI 367",
        "15 Points",
        "Covers algorithms and representational schemes used in artificial intelligence. AI search techniques (e.g., heuristic search, constraint satisfaction, etc.) for solving both optimal and satisficing tasks. Tasks such as game playing (adversarial search), planning, and natural language processing. Discusses and examines the history and future of AI and the ethics surrounding the use of AI in society.",
        [
            "Prerequisite: COMPSCI 220 and 15 points from COMPSCI 225, MATHS 254, 255",
            "Restriction: COMPSCI 761"
        ]
    ],
    [
        "COMPSCI 369",
        "15 Points",
        "Many sciences use computational methods that involve the development and application of computer algorithms and software to answer scientific questions. This course looks at how to tackle these interdisciplinary problems through methods like probabilistic computer modelling, computer-based statistical inference, and computer simulations. The material is largely motivated by the life sciences but also uses examples from other sciences. It focuses on modelling and analysing real-world data with an emphasis on analysing DNA sequence data. No background in physical or life sciences is assumed.",
        [
            "Prerequisite: COMPSCI 220 and 15 points from COMPSCI 225, MATHS 254, 255"
        ]
    ],
    [
        "COMPSCI 373",
        "15 Points",
        "Basic geometric processes including transformations; viewing and projection; back projection and ray tracing. Graphics modelling concepts: primitives, surfaces, and scene graphs, lighting and shading, texture mapping, and curve and surface design. Graphics and image processing fundamentals: image definition and representation, perception and colour models, grey level and colour enhancement, neighbourhood operations and filtering. Use of the OpenGL graphics pipeline.",
        [
            "Prerequisite: COMPSCI 210, 230",
            "Restriction: COMPSCI 771"
        ]
    ],
    [
        "COMPSCI 380",
        "15 Points",
        "",
        []
    ],
    [
        "COMPSCI 380A",
        "7.5 Points",
        "",
        []
    ],
    [
        "COMPSCI 380B",
        "7.5 Points",
        "Each student taking one of these courses will be expected to do an individual practical project under the supervision of a member of staff. Only students with excellent academic records will be allowed to take these courses, and only after a supervisor and topic have been agreed upon by the Head of Department.",
        [
            "Prerequisite: Approval of Academic Head or nominee",
            "Restriction: COMPSCI 690",
            "To complete this course students must enrol in COMPSCI 380 A and B, or COMPSCI 380"
        ]
    ],
    [
        "COMPSCI 389",
        "15 Points",
        "An overview of research methods and techniques used across the discipline of Computer Science, including formal proof techniques and empirical methods that involve quantitative and/or qualitative data. Students will be expected to apply the research methods in a collaborative research project.",
        [
            "Prerequisite: GPA of 5.0 or higher and COMPSCI 289 and 30 points at Stage II in Computer Science"
        ]
    ],
    [
        "COMPSCI 390",
        "15 Points",
        "",
        []
    ],
    [
        "COMPSCI 391",
        "15 Points",
        "",
        []
    ],
    [
        "COMPSCI 392",
        "15 Points",
        "",
        []
    ],
    [
        "COMPSCI 393",
        "15 Points",
        "",
        []
    ],
    [
        "COMPSCI 399",
        "15 Points",
        "Students work in small groups to complete a substantial problem applying the knowledge learnt from the different courses in the Computer Science major. Teams are expected to reason on a problem, devise a solution, produce an artefact and present their work. The capstone provides an opportunity for students to further develop their technical and communication skills.",
        [
            "Prerequisite: 30 points at Stage III in Computer Science and COMPSCI 210, 220, 230"
        ]
    ],
    [
        "COMPSCI 601",
        "15 Points",
        "",
        [
            "Prerequisite: Approval of the Academic Head or nominee"
        ]
    ],
    [
        "COMPSCI 690A",
        "15 Points",
        "",
        []
    ],
    [
        "COMPSCI 690B",
        "15 Points",
        "",
        [
            "Restriction: COMPSCI 380",
            "To complete this course students must enrol in COMPSCI 690 A and B"
        ]
    ],
    [
        "COMPSCI 691A",
        "15 Points",
        "",
        []
    ],
    [
        "COMPSCI 691B",
        "15 Points",
        "",
        [
            "Restriction: COMPSCI 780",
            "To complete this course students must enrol in COMPSCI 691 A and B"
        ]
    ],
    [
        "COMPSCI 700",
        "15 Points",
        "",
        []
    ],
    [
        "COMPSCI 701",
        "15 Points",
        "Developing maintainable software has been an ongoing challenge in the software industry. This course presents the principles and practices that have been proposed for developing maintainable software systems. It will evaluate and critique these principles and practices through examining their application in practice and through understanding the research on their effectiveness.",
        [
            "Prerequisite: COMPSCI 235 or 718"
        ]
    ],
    [
        "COMPSCI 702",
        "15 Points",
        "Covers security features supported by the different platforms for smart devices. Provides an overview of the most popular OS platforms in the market and focuses on security for Android and iOS. Recommended preparation: COMPSCI 340",
        [
            "Prerequisite: Approval of the Academic Head or nominee"
        ]
    ],
    [
        "COMPSCI 703",
        "15 Points",
        "Artificial Intelligence with deep learning has seen recent substantial advances in image understanding and synthesis, NL translation, language modelling, speech recognition and synthesis, simple question answering, game playing, and other intelligence-based skills. This course examines progress towards general, learning-based, solutions to other deep, enduring Artificial Intelligence problems, including planning and reasoning, explanation, natural language understanding and generation, and knowledge acquisition, transfer and use. Recommended preparation: COMPSCI 361, 367",
        [
            "Prerequisite: Approval of the Academic Head or nominee"
        ]
    ],
    [
        "COMPSCI 704",
        "15 Points",
        "",
        [
            "Prerequisite: Approval of the Academic Head or nominee"
        ]
    ],
    [
        "COMPSCI 705",
        "15 Points",
        "Human aspects of computer systems, relevant to commercial solution development and computer science research. Sample topics: advanced evaluation methods; support of pen and touch-based interaction; trends with domain specific user interface design, such as interfaces for enterprise systems. Recommended preparation: COMPSCI 345 or SOFTENG 350.",
        [
            "Prerequisite: Approval of the Academic Head or nominee",
            "Restriction: SOFTENG 702"
        ]
    ],
    [
        "COMPSCI 706",
        "15 Points",
        "",
        [
            "Prerequisite: Approval of the Academic Head or nominee"
        ]
    ],
    [
        "COMPSCI 707",
        "15 Points",
        "",
        [
            "Prerequisite: Approval of the Academic Head or nominee"
        ]
    ],
    [
        "COMPSCI 709",
        "15 Points",
        "",
        [
            "Prerequisite: Approval of the Academic Head or nominee"
        ]
    ],
    [
        "COMPSCI 710",
        "15 Points",
        "",
        [
            "Prerequisite: Approval of the Academic Head or nominee"
        ]
    ],
    [
        "COMPSCI 711",
        "15 Points",
        "Computer architectures and languages for exploring parallelism, conceptual models of parallelism, principles for programming in a parallel environment, different models to achieve interprocess communication, concurrency control, distributed algorithms and fault tolerance. Recommended preparation: COMPSCI 335.",
        [
            "Prerequisite: Approval of the Academic Head or nominee"
        ]
    ],
    [
        "COMPSCI 715",
        "15 Points",
        "An advanced look at current research issues in computer graphics. Typical topics include: ray-tracing acceleration methods; radiosity; subdivision surfaces; physically-based modelling; animation; image-based lighting and rendering; non-photorealistic rendering; advanced texturing. The precise content may vary from year to year. Consult the department for details. Recommended preparation: COMPSCI 373 or equivalent, and 15 points at Stage II in Mathematics.",
        [
            "Prerequisite: Approval of the Academic Head or nominee"
        ]
    ],
    [
        "COMPSCI 717",
        "30 Points",
        "Fundamental techniques are covered for the design of algorithms such as greedy algorithms, divide-and-conquer, and dynamic programming. Data structures are explored that help implement algorithms. Essential tools are taught for analysing algorithms, for example worst- and average-case analyses of space and time. Recommended preparation: 15 points from COMPSCI 120 or equivalent and 15 points from COMPSCI 130 or equivalent",
        [
            "Prerequisite: Approval of Academic Head or nominee",
            "Restriction: COMPSCI 220, 320, SOFTENG 250"
        ]
    ],
    [
        "COMPSCI 718",
        "30 Points",
        "An examination of object-oriented programming and design. Key principles of object-oriented programming: typing, encapsulation, inheritance, polymorphism and composition. Fundamental object-oriented modelling and design techniques. Students will develop application software of reasonable complexity that draws on object-oriented language features, and contemporary APIs, frameworks and tools.",
        []
    ],
    [
        "COMPSCI 719",
        "30 Points",
        "An examination of developing web-based applications. Client-side technologies: HTML, CSS and Javascript. Server-side technologies to support dynamic Web pages and data access. Fundamental relational database concepts and design techniques. Principles of Web-application design. HCI considerations and mobile clients. Students will build a Web-based application that dynamically generates content involving relational database access.",
        []
    ],
    [
        "COMPSCI 720",
        "15 Points",
        "Selected advanced topics in design and analysis of algorithms, such as: combinatorial enumeration algorithms; advanced graph algorithms; analytic and probabilistic methods in the analysis of algorithms; randomised algorithms; methods for attacking NP-hard problems.",
        [
            "Prerequisite: COMPSCI 320"
        ]
    ],
    [
        "COMPSCI 725",
        "15 Points",
        "Data security: confidentiality, integrity, availability. System security: prohibitions, permissions, obligations, exemptions. The gold standard of dynamic security: authentication, audit, authorisation. Governance: specification, implementation, assurance. Three-layer defence: prevention, detection, response. Control modalities: architectural, economic, legal, normative. System-centric analyses: attacks, threats, vulnerabilities, information flows. Owner-centric analyses: functionality, security, trust, distrust. Data-centric analyses. Security techniques: encryption, obfuscation, tamper resistance. System designs. Recommended preparation: 30 points from COMPSCI 313, 314, 320, 335, 340, 351, 702, 734, 742.",
        [
            "Prerequisite: Approval of the Academic Head or nominee"
        ]
    ],
    [
        "COMPSCI 726",
        "15 Points",
        "Focuses on the use and deployment of protective systems used in securing internal and external networks. Examines in detail the widely used protocols including SSL, IPSec, DNSSEC as well as covers infrastructure platform protocols including wireless security (IEEE 802.11). Explores current research and developments in the area of network defence and countermeasures. Recommended preparation: COMPSCI 314, 315",
        [
            "Prerequisite: Approval of the Academic Head or nominee"
        ]
    ],
    [
        "COMPSCI 727",
        "15 Points",
        "Focuses on cryptographic systems used in securing communications and data storage. Provides an overview of encryption algorithms including symmetric key cryptography, public key infrastructure, digital signatures and certificate technologies. The course covers management issues related to cryptography and explores current research and developments in this area. Recommended preparation: COMPSCI 210 or MATHS 120",
        [
            "Prerequisite: Approval of the Academic Head or nominee"
        ]
    ],
    [
        "COMPSCI 732",
        "15 Points",
        "An advanced course examining research issues related to tools and techniques for software design and development. Topics include: techniques for data mapping and data integration, software architectures for developing software tools, issues in advanced database systems. Recommended preparation: COMPSCI 331",
        [
            "Prerequisite: Approval of the Academic Head or nominee"
        ]
    ],
    [
        "COMPSCI 734",
        "15 Points",
        "Examines advanced and emerging software architectures at the confluence of XML, web services, distributed systems, and databases. Includes advanced topics in areas such as: mobile computing, remoting, web services for enterprise integration, workflow orchestrations for the enterprise, peer-to-peer computing, grid computing. Recommended preparation: COMPSCI 335.",
        [
            "Prerequisite: Approval of the Academic Head or nominee"
        ]
    ],
    [
        "COMPSCI 742",
        "15 Points",
        "The protocols and performance of local area networks. The special requirements of very high speed networks (100 Mb/s and higher). Asynchronous transfer mode (ATM) and its relation to other protocols. The TCP/IP suite. Recommended preparation: COMPSCI 314, 315.",
        [
            "Prerequisite: Approval of the Academic Head or nominee"
        ]
    ],
    [
        "COMPSCI 747",
        "15 Points",
        "An overview of topics related to the use of technology in education and how people learn computer science concepts. Topics include research methodologies used in computer science education, how novices learn to program, and how technology can engage students in active learning, facilitate collaboration and enhance traditional educational practice. Recommended preparation: 30 points at Stage III in Computer Science",
        [
            "Prerequisite: Approval of the Academic Head or nominee"
        ]
    ],
    [
        "COMPSCI 750",
        "15 Points",
        "Definitions of computational models and complexity classes: time complexity (e.g., P and NP), space complexity (e.g., L and PSPACE), circuit and parallel complexity (NC), polynomial-time hierarchy (PH), interactive complexity (IP), probabilistic complexity (BPP), and fixed-parameter complexity. Recommended preparation: COMPSCI 320 or 350.",
        [
            "Prerequisite: Approval of the Academic Head or nominee"
        ]
    ],
    [
        "COMPSCI 751",
        "15 Points",
        "Database principles. Relational model, relational algebra, relational calculus, SQL, SQL and programming languages, entity-relationship model, normalisation, query processing and query optimisation, ACID transactions, transaction isolation levels, database recovery, database security, databases and XML. Research frontiers in database systems. Recommended preparation: COMPSCI 220, 225.",
        [
            "Prerequisite: Approval of the Academic Head or nominee",
            "Restriction: COMPSCI 351, SOFTENG 351"
        ]
    ],
    [
        "COMPSCI 752",
        "15 Points",
        "The deep diversity of modern-day data from many companies requires data scientists to master many technologies that rely on new principles to represent, describe, access, and analyse data. The course will provide insight into the rich landscape of big data modelling, management, and analysis in distributed and heterogeneous environments. Recommended preparation: COMPSCI 351.",
        [
            "Prerequisite: Approval of the Academic Head or nominee"
        ]
    ],
    [
        "COMPSCI 753",
        "15 Points",
        "Modern enterprises and applications such as electronic commerce, social networks, location services, and scientific databases are generating data on a massive scale. Analysis of such data must be carried out by scalable algorithms. This course exposes data science practitioners and researchers to various advanced algorithms for processing and mining massive data, and explores best-practices and state-of-the-art developments in big data. Recommended preparation: COMPSCI 320",
        [
            "Prerequisite: Approval of the Academic Head or nominee"
        ]
    ],
    [
        "COMPSCI 760",
        "15 Points",
        "An overview of the learning problem and the view of learning by search. Covers techniques for learning such as: decision tree learning, rule learning, exhaustive learning, Bayesian learning, genetic algorithms, reinforcement learning, neural networks, explanation-based learning and inductive logic programming. Experimental methods necessary for understanding machine learning research.",
        [
            "Prerequisite: COMPSCI 361 or 762"
        ]
    ],
    [
        "COMPSCI 761",
        "15 Points",
        "Examines the cornerstones of AI: representation, utilisation, and acquisition of knowledge. Taking a real-world problem and representing it in a computer so that the computer can do inference. Utilising this knowledge and acquiring new knowledge is done by search which is the main technique behind planning and machine learning. Research frontiers in artificial intelligence.",
        [
            "Prerequisite: COMPSCI 220 and 15 points from COMPSCI 225, MATHS 254, 255",
            "Restriction: COMPSCI 367"
        ]
    ],
    [
        "COMPSCI 762",
        "15 Points",
        "Machine learning is a branch of artificial intelligence concerned with making accurate, interpretable, computationally efficient, and robust inferences from data to solve a given problem. Students will be introduced to the foundations of machine learning and will gain practical skills to solve different problems. Students will explore research frontiers in machine learning.",
        [
            "Prerequisite: COMPSCI 220, and 15 points from DATASCI 100, STATS 101, 108, and 15 points from COMPSCI 225, MATHS 254, 255",
            "Restriction: COMPSCI 361"
        ]
    ],
    [
        "COMPSCI 765",
        "15 Points",
        "How can researchers of artificial intelligence effectively model subjective aspects of minds, such as emotional states, desires, perceptual experience and intrinsic goals? This course draws upon interdisciplinary methods and considers classic and emerging approaches to try to answer this question. Recommended preparation: COMPSCI 367.",
        [
            "Prerequisite: Approval of the Academic Head or nominee"
        ]
    ],
    [
        "COMPSCI 767",
        "15 Points",
        "An introduction to the design, implementation and use of intelligent software agents (e.g., knowbots, softbots etc). Reviews standard artificial intelligence problem-solving paradigms (e.g., planning and expert systems) and knowledge representation formalisms (e.g., logic and semantic nets). Surveys agent architectures and multi-agent frameworks.",
        [
            "Prerequisite: COMPSCI 367 or 761"
        ]
    ],
    [
        "COMPSCI 771",
        "15 Points",
        "Basic geometric processes including transformations; viewing and projection; back projection and ray tracing. Graphics modelling concepts: primitives, surfaces, and scene graphs, lighting and shading, texture mapping, and curve and surface design. Graphics and image processing fundamentals: image definition and representation, perception and colour models, grey level and colour enhancement, neighbourhood operations and filtering. Use of the OpenGL graphics pipeline. Research frontiers in computer graphics and image processing. Recommended preparation: COMPSCI 210, 230.",
        [
            "Prerequisite: Approval of the Academic Head or nominee",
            "Restriction: COMPSCI 373"
        ]
    ],
    [
        "COMPSCI 773",
        "15 Points",
        "Computational methods and techniques for computer vision are applied to real-world problems such as 2/3D face biometrics, autonomous navigation, and vision-guided robotics based on 3D scene description. A particular feature of the course work is the emphasis on complete system design. Recommended preparation: COMPSCI 373 and 15 points at Stage II in Mathematics.",
        [
            "Prerequisite: Approval of Academic Head or nominee"
        ]
    ],
    [
        "COMPSCI 775",
        "15 Points",
        "Camera calibration, image sequence analysis, computer vision, 3D visualisation, ground truth for image sequence analysis, performance evaluation (noise, accuracy). Applications in vision-based driver assistance, panoramic or 3D visualisation using recorded images, or image and video retrieval. Recommended preparation: COMPSCI 373 and MATHS 208 or 250.",
        [
            "Prerequisite: Approval of Academic Head or nominee"
        ]
    ],
    [
        "COMPSCI 777",
        "15 Points",
        "An advanced course looking at some of the computer graphics and artificial intelligence technology involved in computer games. Typical topics are: an introduction to the gaming industry; commercial modelling and animation software; maximising graphics performance, including such techniques as visibility preprocessing, multiple levels of detail, space subdivision, fast collision detection, direct programming of the graphics card; AI for computer games, including decision trees, rule-based systems, path planning, flocking behaviours, intelligent agents; research issues, such as physically-based modelling, terrain generation, computer learning. Recommended preparation: COMPSCI 367, 373.",
        [
            "Prerequisite: Approval of Academic Head or nominee"
        ]
    ],
    [
        "COMPSCI 778",
        "60 Points",
        "Enables the development of practical knowledge and hands-on experience through a supervised internship in the IT industry. Students complete a research-informed project, and present both written and oral reports of their findings.",
        []
    ],
    [
        "COMPSCI 780",
        "15 Points",
        "",
        []
    ],
    [
        "COMPSCI 780A",
        "7.5 Points",
        "",
        []
    ],
    [
        "COMPSCI 780B",
        "7.5 Points",
        "",
        [
            "Prerequisite: Approval of Academic Head or nominee",
            "Restriction: COMPSCI 691",
            "To complete this course students must enrol in COMPSCI 780 A and B, or COMPSCI 780"
        ]
    ],
    [
        "COMPSCI 789A",
        "15 Points",
        "",
        []
    ],
    [
        "COMPSCI 789B",
        "15 Points",
        "",
        []
    ],
    [
        "COMPSCI 789U",
        "2.5 Points",
        "",
        [
            "Prerequisite: Approval of Academic Head or nominee",
            "To complete this course students must enrol in COMPSCI 789 A and B"
        ]
    ],
    [
        "COMPSCI 791",
        "30 Points",
        "",
        []
    ],
    [
        "COMPSCI 791A",
        "15 Points",
        "",
        []
    ],
    [
        "COMPSCI 791B",
        "15 Points",
        "",
        [
            "To complete this course students must enrol in COMPSCI 791 A and B, or COMPSCI 791"
        ]
    ],
    [
        "COMPSCI 796A",
        "60 Points",
        "",
        []
    ],
    [
        "COMPSCI 796B",
        "60 Points",
        "",
        [
            "To complete this course students must enrol in COMPSCI 796 A and B"
        ]
    ]
]